2025/cfp.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LSFA 2025</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" />
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
  <div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
    <a href="/index.html"><h1 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>LSFA 2025</h1></a>
    <div>
      <a href='index.html' style='font-weight:bold; font-style:italic;'>Home</a> / 
      <a href='cfp.html' style='font-weight:bold; font-style:italic;'>CFP</a> /
      <a href='committees.html' style='font-weight:bold; font-style:italic;'>Committees</a> /
      <a href='accepted.html' style='font-weight:bold; font-style:italic;'>Accepted papers</a> /
      <a href='invited.html' style='font-weight:bold; font-style:italic;'>Invited Speakers</a> /
      <a href='programme.html' style='font-weight:bold; font-style:italic;'>Programme</a> /
      <a href='venue.html' style='font-weight:bold; font-style:italic;'>Venue</a> //
    </div>
  </div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">

<div id="outline-container-orga352e8d" class="outline-2">
<h2 id="orga352e8d">Call For Papers</h2>
<div class="outline-text-2" id="text-orga352e8d">
</div>
<div id="outline-container-orgf5b4a61" class="outline-3">
<h3 id="orgf5b4a61">Topics of interest to this forum include, but are not limited to:</h3>
<div class="outline-text-3" id="text-orgf5b4a61">
<ul class="org-ul">
<li>Automated deduction</li>

<li>Applications of logical and/or semantic frameworks</li>

<li>Computational and logical properties of semantic frameworks</li>

<li>Formal semantics of languages and systems</li>

<li>Implementation of logical and/or semantic frameworks</li>

<li>Lambda and combinatory calculi</li>

<li>Logical aspects of computational complexity</li>

<li>Logical frameworks</li>

<li>Process calculi</li>

<li>Proof theory</li>

<li>Semantic frameworks</li>

<li>Specification languages and meta-languages</li>

<li>Type theory</li>
</ul>

<p>
Contributions should be written in English and submitted in the form of full papers (with a maximum of 16 pages) or short papers (with a maximum of 6 pages). They must be unpublished and not submitted simultaneously for publication elsewhere. The papers should be prepared in latex using EPTCS style. The submission should be in the form of a PDF file uploaded to EasyChair: 
</p>

<p>
<a href="https://easychair.org/conferences/?conf=lsfa2025">https://easychair.org/conferences/?conf=lsfa2025</a> (<b>TBD</b>)
</p>
</div>
</div>

<div id="outline-container-org01ab132" class="outline-3">
<h3 id="org01ab132">Important Dates</h3>
<div class="outline-text-3" id="text-org01ab132">
<ul class="org-ul">
<li>Abstract: <b>TBD</b></li>
<li>Submission: <b>TBD</b></li>
<li>Notification: <b>TBD</b></li>
<li>Preliminary proceedings version due: <b>TBD</b></li>
<li>Submission for final proceedings: <b>TBD</b></li>
<li>Final version: <b>TBD</b></li>
</ul>
</div>
</div>

<div id="outline-container-orgb768091" class="outline-3">
<h3 id="orgb768091">Proceedings</h3>
<div class="outline-text-3" id="text-orgb768091">
<p>
The pre-proceedings, containing the reviewed extended abstracts, will be handed-out at event registration. After the meeting the authors will be invited to submit full versions of their works for the post-proceedings publication in EPTCS (<b>TBC</b>). At least one of the authors should register for the conference. Presentations should be in English.
</p>

<p>
According to the quality of submissions, the chairs will promote further publication of journal revised versions of the papers. Previous LSFA Special Issues have been published in journals as The Logical J. of the IGPL, Theoretical Computer Science and Mathematical Structures in Computer Sciences (see the LSFA page <a href="https://lsfa-workshop.github.io/">https://lsfa-workshop.github.io/</a>).
</p>
</div>
</div>
</div>
</div>
</body>
</html>
